Repository: RushHQ/aaaaaaaaaaaaaa
Catalog: tiktoker/locale/*/LC_MESSAGES/general.po
Languages: ja, pl, vi

source: What is TikToker?
ja: TikTokerとは？
pl: Czym jest TikToker?
vi: Tiktoker là gì?

source: Tiktoker is a bot that allows you to send playable TikTok videos to your Discord server.
ja: Tiktokerは再生可能なTikTok動画をDiscordサーバーに送信するボットです。
pl: Tiktoker to bot, który pozwala na wysyłanie oglądalnych Tiktoków do twojego serwera Discord.
vi: Tiktoker là 1 con bot giúp bạn gửi những video Tiktok tới server Discord của bạn.

source: Help Menu
ja: ヘルプメニュー
pl: Menu Pomocy
vi: Bảng trợ giúp

source: Click the arrow buttons below to navigate the help menu.
ja: 下の矢印ボタンをクリックすると、ヘルプメニューを移動できます。
pl: Użyj przycisków strzałek poniżej, aby nawigować się po menu pomocy.
vi: Click vào mũi tên bên dưới để điều hướng đến menu trợ giúp.

source: Server Configuration
ja: サーバー設定
pl: Konfiguracja Serwera
vi: Cài đặt server

source: You may view the configuration of your server with `/config`. To edit the config use, `/config <option>`. Example: `/config delete_origin:True`
ja: あなたのサーバーの設定は`/config`にあります。 設定を変更するには`/config <option>`を使用してください。 例: `/config delete_origin:True`
pl: Możesz zobaczyć konfigurację swojego serwera za pomocą `/config`. Aby ją edytować, użyj `/config <option>`. Przykład: `/config delete_origin:True`
vi: Bạn có thể xem cấu hình server của bạn bằng `/config`. Để chỉnh sửa việc sử dụng cấu hình, sử dụng `/config <option>`. Ví dụ: `/config delete_origin:True`

source: If enabled, the bot will automatically embed the Tiktok links.
ja: 有効にすると、ボットは自動的にTiktokのリンクを埋め込みます。
pl: Kiedy włączone, bot będzie automatycznie embedował linki TikTok.
vi: Khi đã được bật, bot sẽ tự động đính kèm vào link Tiktok.

source: If enabled and _Auto Embed_ is enabled, the bot will delete the origin message containing the TikTok link.
ja: この設定と_Auto Embed_の両方を有効にすると、ボットは元のTiktokのリンクを含むメッセージを削除します。
pl: Gdy włączone oraz _Auto Embed_ jest włączone, bot będzie usuwał oryginalną wiadomość zawierającą link do TikToka.
vi: Khi được kích hoạt và _Auto Embed_ đã được bật, bot sẽ tự động xóa tin nhắn đã gửi link TikTok.

source: If enabled, the origin embed will be removed.
ja: 有効にすると、元の埋め込みは削除されます。
pl: Gdy włączone, oryginalny embed będzie usuwany.
vi: Khi đã được kích hoạt, mã nhúng đính kèm tin nhắn gốc sẽ bị xóa.

source: Set the language of the bot.
ja: ボットの言語を設定してください。
vi: Thiết lập ngôn ngữ của giao diện.

source: Commands
ja: コマンド
pl: Komendy
vi: Lệnh

source: Here are some commands to interact with the bot.
ja: ボットのコマンドはこちらです。
pl: Oto kilka poleceń do interakcji z botem.
vi: Đây là một số câu lệnh có thể được dùng để tương tác với bot.

source: To use, right-click a message, go to `Apps > Convert %s`. Useful for when _Auto Embed_ is disabled in your server's configuration.
ja: 使用するには、メッセージを右クリックし、`アプリ > Convert %s`を選択してください。これは、サーバー設定で_Auto Embed_が無効になっている場合に便利です。
pl: Aby użyć, kliknij prawym na wiadomość, a następnie przejdź do `Aplikacje > Convert %s`. Przydatne, jeśli _Auto Embed_ jest wyłączone w konfiguracji serwera.
vi: Để sử dụng, nhấp chuột phải vào tin nhắn và chọn `Ứng dụng > Convert %s`. Bạn nên làm điều này khi _Auto Embed_ bị vô hiệu hóa trong cài đặt server của bạn.

source: A slash command that takes a TikTok link and returns the video. Useful for when _Auto Embed_ is disabled in your server's configuration.
ja: TikTokのリンクを取得し、TikTok動画を返すスラッシュコマンドです。サーバー設定で_Auto Embed_が無効になっている場合に便利です。
pl: Komenda, która bierze link do TikToka i zwraca wideo. Przydatna, jeśli _Auto Embed_ jest wyłączone w konfiguracji serwera.
vi: Một lệnh gạch sẽ nhận một link Tiktok và trả về một video. Hữu dụng khi _Auto Embeded_ bị tắt trong cài đặt server của bạn.

source: Provides some general information and statistics about TikToker.
ja: TikTokerに関する一般的な情報と統計情報を提供します。
vi: Cung cấp một vài thông tin cơ bản và dữ liệu về TikToker.

source: This menu is not for you
ja: このメニューはあなたのためのものではありません。
vi: Menu này không dành cho bạn

source: Opted-out
ja: 拒否
pl: Nie wyrażono zgody
vi: Hủy đăng ký

source: Opted-in
ja: 承諾
pl: Wyrażono zgodę
vi: Đăng ký nhận tin

source: You are currently: %s **We take your privacy seriously.** Your data is not public. Usage data provides statistics like total videos converted and total users. Please consider sharing your usage data with us to help improve the bot. View the help command for more information on how we handle your privacy.
ja: あなたは現在: %s **私たちはプライバシーを重視しています。** あなたのデータは公開されません。利用状況データは、変換された動画の合計やユーザー数の合計などの統計情報を提供します。ボットの改善のため、利用状況データの共有をご検討ください。私たちがあなたのプライバシーをどのように処理するかについては、ヘルプコマンドを参照してください。
pl: Aktualnie: %s **Bierzemy twoją prywatność na poważnie.** Twoje dane nie są upubliczniane. Dane o użytkowaniu umożliwiają statystyki takie jak ilość przekonwertowanych filmów oraz ilość użytkowników. Proszę rozważ udostępnienie nam tych danych, aby pomóc nam w ulepszaniu bota. Zobacz komendę help aby uzyskać więcej informacji o naszym sposobie postępowania z twoimi danymi.
vi: Hiện tại bạn đang: %s **Chúng tôi rất nghiêm túc trong việc bảo vệ quyền riêng tư của bạn** Dữ liệu của bạn sẽ không được công khai. Sử dụng dữ liệu cung cấp những thống kê như tổng số video đã được chuyển đổi và tổng số người dùng. Hãy cân nhắc việc chia sẻ dữ liệu sử dụng của bạn với chúng tổi để giúp cải thiện con bot. Xem lệnh trợ giúp để biết thêm thông tin về cách chúng tôi xử lý quyền riêng tư của bạn.

source: Thank you for sharing your usage data. It will go towards improving the bot.
ja: 利用状況データを共有いただきありがとうございます。ボットの改善に利用させていただきます。
pl: Dziękujemy za udostępnianie danych o użytkowaniu. Pomoże nam to w ulepszaniu bota.
vi: Cảm ơn bạn vì đã đồng ý chia sẻ dữ liệu cá nhân. Điều này có thể giúp chung tôi cải thiện con bot.

source: You have opted out of usage data collection. Thank you for your time.
ja: 利用状況データの収集を解除しました。ご利用ありがとうございます。
pl: Zrezygnowano ze zbierania danych o użytkowaniu. Dziękujemy za poświęcony czas.
vi: Bạn đã từ chối việc thu thập dữ liệu. Cảm ơn vì thời gian quý báu của bạn.

source: Your usage data for this server has been deleted.
ja: このサーバーの利用状況データは削除されました。
pl: Twoje dane o użytkowaniu dla tego serwera zostały usunięte.
vi: Dữ liệu cá nhân của bạn trong máy chủ này đã được xóa bỏ.

source: You do not have permission to use this command. Reason: `Missing Manage Server Permission`
vi: Bạn không có quyền sử dụng lệnh này. Lí do: `Không có quyền quản lý máy chủ`

source: Current Config
ja: 現在の設定
pl: Bieżąca Konfiguracja
vi: Cài đặt hiện tại

source: To change a setting, use `/config <setting> <value>`.
ja: 設定を変更するには、`/config <setting> <value>`を使用してください。
pl: Aby zmienić opcję, użyj `/config <setting> <value>`.
vi: Để thay đổi cài đặt, sử dụng `/config <setting> <value>`.

source: TikToker Info
ja: TikToker情報
vi: Thông tin về TikToker

source: Here is some general information and statistics about TikToker.
ja: こちらがTikTokerに関する一般的な情報と統計情報です。
vi: Đây là một vào thông tin cơ bản và dữ liệu về Tiktoker.

source: TikToks Converted %s
ja: 変換されたTikTok動画 %s
vi: Số TikTok đã được chuyển đổi %s

source: Converted Today %s
ja: 今日変換されたTikTok動画 %s
vi: Đã chuyển đổi hôm nay %s

source: Most Popular TikTok %s
ja: 最も人気のあるTikTok動画 %s
vi: Video nổi tiếng nhất %s

source: Server Count %s
ja: サーバー数 %s
vi: Số lượng server %s

source: User Count %s
ja: ユーザー数 %s
vi: Số người dùng %s

source: Commit Version %s
ja: コミットバージョン %s
vi: Phiên bản %s

source: This command is on cooldown. Try again in %s seconds.
ja: このコマンドはクールダウン中です。%s秒後にもう一度試してください。
vi: Lệnh này đang trong thời gian hồi. Hãy thử lại sau %s giây.
